{
	"pageTitle" : "Selina No! - Roymond.NET",
	"jumbotron" : "Selina No!",
	"active" : "projects",
	"quickfacts": {
		"GitHub": ["external", "https://github.com/rgero/SelinaNo"]
	},
	"pageContent":
		[
			[
				{"heading": "About the project"},
				{"paragraph": "Selina No was my first attempt at a game. It was inspired by my girlfriend's cat, Selina. There was a period of time where I would go over to my girlfriend's apartment and her cat would do everything in its power to avoid me. In the few times she wandered out from her hiding places, she would be rather inquisitive of me, but she would smell my own cat's scent would often send her running off after a brief hiss."},
				{"paragraph": "These weird interactions were what inspired me to make a game about her. At the time I was enrolled in an online course on Coursera.com called \"Beginning Game Programming with C#.\" The goal of this course was to teach the fundamentals of the Monogame/XNA Game Studio framework, so it seemed like it was a perfect medium for a tongue in cheek game."},
				{"paragraph": "The game was simple to play. You would control Selina and your goal is to eat all of the Becky's. The Becky's would continually spawn and fire basketballs at you. Every basketball that hit you would deplete a piece of your health and the game would end once your health had been depleted."},
				{"paragraph": "Here is a video playlist of some of the development process."},
				{"iframe": "https://www.youtube.com/embed/videoseries?list=PLt8jpMmYQwh31QjWd3Pd5kDo3S5knLwZ2"},
				{"heading": "Looking back now"},
				{"paragraph": "Unfortunately, XNA Game Studio reached the end of its life on January 31st, 2013. When I was enrolled in the course, I had to install an older version of Visual Studio to make the framework. I have upgraded the game to the latest MonoGame and Visual Studio, so when I do get some time I will be making some improvements to it. Here is a brief list of improvements that I would like to make to the game while attempting to keep it's silly nature."},
				{"paragraph": "The first thing I would improve would be the graphics and sound. I remember when I was initially working on this project, I was ok with the idea of simple graphics and sounds because it was meant to be silly (and I also am not the best with creating assets). Now that I am enrolled in a <a href='https://www.udemy.com/learn-professional-pixel-art-animation-for-games/'>pixel art class</a>, I plan to create new graphics for the projectiles, a more immersive background and probably some more interesting sounds (except for the Yum sound... that one is staying)."},
				{"paragraph": "The second thing would be the controls. Originally the game use the mouse to move Selina around, there were no other options for the player. I feel it would be a fun experience to add support for a keyboard as well as a controller."},
				{"paragraph": "Another thing that I believe would be worth doing would be to add a sort of physics to the player. Think of how when Mario is running at full speed, he doesn't come to an immediate stop when you let go of the direction. I feel that this would add a degree of difficulty that might be missing in the game."},
				{"paragraph": "The last thing I would like to improve would be the targeting. In the original version of the game, the enemy would look at their position and the player's position and form an unit direction that would connect the two. This meant that if you were moving around, you could easily dodge every shot. I would like to add some randomness to it so that way it is a bit more difficult."}
			]
		]
}
