{
  "pageTitle" : "The Old Background Generator - Roymond.NET",
  "jumbotron" : "The Old Background Generator",
  "active" : "projects",
  "quickfacts": {
		"GitHub": ["external", "https://github.com/rgero/BackgroundGenerator_Legacy"],
		"JAR File": ["internal_file","projects/java/jar_files/BackgroundGenerator.jar"]
	},
  "pageContent":
  [
    [ {"h3" : ["None","About the Project"]},
      {"p" : ["None","I've always been one of those people who loves making small changes in my life to constantly provide a subtle note of freshness in it. In college, I’d regularly redesign the layout of my dorm room at the beginning of each semester to motivate myself and to make it feel like it was a new start. This concept often ended up finding a way into my electronics. I’d often change the backgrounds, colors, sounds and other things of that nature. This led to having a rather large folder of background images, which would often vary from things I am interested in, to ones that I just thought were pretty cool."]},
      {"p" : ["None","Over time, I started to fall in love with procedurally generated backgrounds. I thought that it was rather cool to see an image that was generated from a computer. From this interest, I set out to see if I could develop something that would generate backgrounds for me."]},
      {"h3" : ["None","Challenges"]},
      {"unordered_list" : ["How to design a functional UI using Java.", "How to handle the large number of input variables."]},
      {"h3" : ["None","Lessons Learned"]},
      {"unordered_list" : ["How to make a GUI using JFrame","How to use a builder pattern", "How to use Source Control within IntelliJ - I regularly use source control, but never within my IDE", "How to distribute a java project with a JAR file."]}
    ]
  ],
  "gallery":
  [
    {	"settings": {
			"width": 150,
			"height": 150,
			"maxRow": 4
		},
		  "imgData": [
  			[0, {
  				"The UI": "projects/java/background_old/background_UI.png"
  			}],
  			[1, {
  				"Avs Logo": "projects/java/background_old/Avs_Example.png"
  			}],
  			[2, {
  				"Bruins Logo": "projects/java/background_old/Bruins_Example.png"
  			}],
        [3, {
          "Red Sox Example": "projects/java/background_old/RedSox_Example.png"
        }]
	    ]
    }]
}
